[
    {
        "id": 1,
        "content": "Dari ‘Abdullah bin ‘Amr radhiyallahu ‘anhuma, Nabi shallallahu ‘alaihi wa sallam bersabda, “Waktu Zhuhur dimulai sejak matahari sudah tergelincir sampai bayang-bayang seseorang sama dengan tingginya selama belum masuk waktu Ashar. Waktu shalat Ashar selama matahari cahayanya belum menguning. Waktu shalat Maghrib selama syafaq (cahaya merah) belum hilang. Waktu shalat Isya’ hingga pertengahan malam dan waktu shalat Shubuh dimulai dari terbitnya fajar sampai terbitnya matahari.",
        "source": "HR. Muslim, no. 612, 173"
    },
    {
        "id": 2,
        "content": "Ibadah shalat itu tak hanya membawa ketenangan di dunia, namun juga di akhirat.",
        "source": "-"
    },
    {
        "id": 3,
        "content": "\"Apakah yang memasukkan kamu ke dalam Saqar (neraka)?\" Mereka menjawab: \"Kami dahulu tidak termasuk orang-orang yang mengerjakan shalat\"",
        "source": "Surah Al-Mudatstsir:42-43"
    },
    {
        "id": 4,
        "content": "Perjanjian antara kami dengan orang kafir adalah sholat. Barangsiapa yang meninggalkan sholat maka ia telah kafir.",
        "source": "HR. Ahmad, Abu Daud"
    },
    {
        "id": 5,
        "content": "Terkadang hidup ibarat lampu lalu lintas, adakalanya lampu merah berhenti dari kesibukan, yuk sholat!",
        "source": "-"
    },
    {
        "id": 6,
        "content": "Perjanjian antara kami dengan orang kafir adalah sholat. Barangsiapa yang meninggalkan sholat maka ia telah kafir.",
        "source": "HR. Ahmad, Abu Daud"
    },
    {
        "id": 7,
        "content": "Seandainya kamu tahu betapa dahsyatnya sujud, kamu pasti tidak akan pernah mengangkat kepalamu dari tanah.",
        "source": "-"
    },
    {
        "id": 8,
        "content": "Jagalah sholatmu. Karena saat kamu kehilangan sholat, maka kamu akan kehilangan segalanya.",
        "source": "Umar bin Khattab"
    },
    {
        "id": 9,
        "content": "Jika kaki yang kamu miliki saja tidak bisa membawamu mendatangi salat, lalu bagaimana kamu mengharapkan kakimu itu akan membawamu ke surga?",
        "source": "-"
    },
    {
        "id": 10,
        "content": "Mengerjakan salat itu ibarat kamu mengetuk pintu Allah, dan siapapun yang mengetuk pintu Allah, maka Allah akan membukakan pintu itu untuknya.",
        "source": "-"
    },
    {
        "id": 11,
        "content": "Salat bukanlah untuk Allah, tapi untuk dirimu sendiri. Allah tidak membutuhkan kita, tapi kitalah yang membutuhkan Allah.",
        "source": "-"
    },
    {
        "id": 12,
        "content": "Dari Ummu Salamah radhiyallahu ‘anha, Rasulullah shallallahu ‘alaihi wa sallam bersabda, “Sebaik-baik masjid bagi para wanita adalah di bagian dalam rumah mereka.",
        "source": "HR. Ahmad, 6: 297"
    },
    {
        "id": 13,
        "content": "Pokok dari perkara adalah Islam, tiangnya adalah salat, dan puncaknya adalah jihad.",
        "source": "HR. Tirmidzi"
    },
    {
        "id": 14,
        "content": "Islam adalah, engkau bersaksi tidak ada yang berhak diibadahi dengan benar melainkan hanya Allah, dan sesungguhnya Muhammad adalah Rasul Allah; menegakkan shalat; menunaikan zakat; berpuasa di bulan Ramadhan, dan engkau menunaikan haji ke Baitullah, jika engkau telah mampu melakukannya.",
        "source": "HR Muslim No.8"
    },
    {
        "id": 15,
        "content": "Perintahkanlah anak-anak kalian untuk salat di umur tujuh tahun, dan pukullah jika mereka tidak melaksanakannya di umur sepuluh tahun, dan pisahkanlah mereka dalam tempat tidurnya.",
        "source": "HR. Abu Dawud"
    },
    {
        "id": 16,
        "content": "Mengharapkan surga tapi mengabaikan salat, itu ibarat menunggu kereta api tiba di bandara.",
        "source": "-"
    },
    {
        "id": 17,
        "content": "Islam dibangun atas lima perkara, yaitu : (1) bersaksi bahwa tidak ada sesembahan yang benar untuk diibadahi kecuali Allah dan bersaksi bahwa Muhammad adalah utusan-Nya, (2) mendirikan shalat, (3) menunaikan zakat, (4) naik haji ke Baitullah -bagi yang mampu-, (5) berpuasa di bulan Ramadhan.",
        "source": "HR. Bukhari no. 8 dan Muslim no. 16"
    },
    {
        "id": 18,
        "content": "Tidak ada bagian dalam Islam bagi orang yang meninggalkan shalat.",
        "source": "-"
    },
    {
        "id": 19,
        "content": "Tidak Dibolehkan Wanita yang Bukan Mahrom Bermakmum di Belakang Seorang Pria, Nabi shallallahu ‘alaihi wa sallam bersabda, “Janganlah seorang laki-laki berduaan dengan seorang wanita yang tidak halal baginya karena sesungguhnya syaithan adalah orang ketiga di antara mereka berdua kecuali apabila bersama mahromnya.",
        "source": "HR. Ahmad no. 15734"
    },
    {
        "id": 20,
        "content": "Ada dua hal yang jika keduanya baik pada diri seorang hamba, akan baik pula selainnya. Dua hal tersebut adalah salatnya dan lisannya.",
        "source": "-"
    },
    {
        "id": 21,
        "content": "Sesungguhnya sholatku, ibadahku, hidupku dan matiku hanyalah untuk Allah, Tuhan semesta alam.",
        "source": "QS. Al-An'am: 162"
    },
    {
        "id": 22,
        "content": "Shalat adalah cahaya, dan shalat malam adalah kemuliaan bagi orang beriman.",
        "source": "-"
    },
    {
        "id": 23,
        "content": "Barang siapa menjaga shalat, maka ia akan mendapatkan cahaya, petunjuk, dan keselamatan pada hari kiamat.",
        "source": "HR. Ahmad"
    },
    {
        "id": 24,
        "content": "Seseorang akan lebih dekat kepada Rabb-nya ketika ia sedang sujud.",
        "source": "HR. Muslim"
    },
    {
        "id": 25,
        "content": "Shalat adalah tiang agama. Barang siapa mendirikannya, maka ia telah menegakkan agama.",
        "source": "HR. Baihaqi"
    },
    {
        "id": 26,
        "content": "Ketika kamu merasa dunia begitu berat, ingatlah untuk sujud. Di sanalah segalanya menjadi ringan.",
        "source": "-"
    },
    {
        "id": 27,
        "content": "Shalat lima waktu adalah penghapus dosa di antara waktu-waktu tersebut, selama dosa besar dijauhi.",
        "source": "HR. Muslim"
    },
    {
        "id": 28,
        "content": "Sujudlah lebih lama, karena itulah saat terdekatmu dengan Allah.",
        "source": "-"
    },
    {
        "id": 29,
        "content": "Shalat tepat waktu adalah bentuk cinta paling nyata kepada Allah.",
        "source": "-"
    },
    {
        "id": 30,
        "content": "Jika hatimu gelisah, cobalah periksa wudumu dan perbaikilah shalatmu.",
        "source": "-"
    },
    {
        "id": 31,
        "content": "Jangan tinggalkan shalat, karena ia adalah perkara pertama yang akan dihisab di hari akhir.",
        "source": "HR. Tirmidzi"
    },
    {
        "id": 32,
        "content": "Shalat bukan hanya kewajiban, tapi juga kebutuhan. Ia menyembuhkan jiwa yang lelah.",
        "source": "-"
    },
    {
        "id": 33,
        "content": "Jika kamu terlalu sibuk untuk shalat, berarti kamu lebih sibuk dari yang Allah kehendaki untukmu.",
        "source": "-"
    },
    {
        "id": 34,
        "content": "Ketahuilah, shalat adalah pertemuan istimewa antara hamba dan Rabb-nya. Jangan kau lewatkan.",
        "source": "-"
    },
    {
        "id": 35,
        "content": "Shalat adalah penenang hati bagi orang-orang beriman.",
        "source": "QS. Al-Baqarah: 45"
    },
    {
        "id": 36,
        "content": "Jangan pernah menunda shalat, sebab kematian tidak pernah menunda kedatangannya.",
        "source": "-"
    },
    {
        "id": 37,
        "content": "Dalam sujud ada ketenangan, dalam doa ada harapan, dalam shalat ada keajaiban.",
        "source": "-"
    },
    {
        "id": 38,
        "content": "Shalat tidak akan memberatkanmu, kecuali jika hatimu jauh dari Allah.",
        "source": "-"
    },
    {
        "id": 39,
        "content": "Setiap kali kamu shalat, kamu sedang memperkuat hubunganmu dengan Sang Pencipta.",
        "source": "-"
    },
    {
        "id": 40,
        "content": "Wahai jiwa yang gelisah, carilah ketenangan dalam shalat. Di sanalah tempatmu kembali.",
        "source": "-"
    },
    {
        "id": 41,
        "content": "Shalat adalah obat bagi hati yang lelah, penawar bagi jiwa yang luka.",
        "source": "-"
    }
]